"""
(0.0) -> (233,666)
移动方式2种 右移 x轴一定距离
           以(0.0)为圆心 以当前位置与圆心距离为半径 的圆周 移动  不限方向
求移动距离

第一步 先沿x轴移动到两点直线距离位置   (r,0)
第二部 旋转 左旋 直接移动到(233,666)

(错
第一次位于原点 只能选择右移
只需移动三次即可到达 第一次右移666 (666,0)
第二次旋转到y轴  (0,666)
第三次右移233   (233,666)

只需两次
)

距离: 直线距离+弧长

计算弧长 l=圆心角(弧度值)*半径=αr
想计算圆心角(弧度值) 利用到反正切函数atan

正切值 对边/邻边       反正切 邻边/对边
α=arctan(对边/邻边)

反正切公式 atan


import math

jiaodu=math.atan(666/233)
hu=jiaodu*math.sqrt(233*233+666*666)
print(int(math.sqrt(233*233+666*666)+hu))
"""
import os
import sys
import math
du = math.atan(666/233)  # 求弧度数
hu = du*math.sqrt(233*233+666*666)  # l=α*r   r=两点间距离 勾股定理
result=hu+math.sqrt(233*233+666*666)
# 第一次右移到两点间距离处
# 第二次旋转
print(int(result))




