import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;

public class data_structure3 {
    public static void main(String[] args) {
        /* 数据结构
            计算机底层存储、组织数据的方式
            指数据相互之间是以什么方式排列在一起的
            提高数据的存储效率和处理效率

            1.每种数据结构长什么样子
            2.如何添加数据
            3.如何删除数据

            此处主要学习
            1.栈
            2.队列
            3.数组
            4.链表
            5.二叉树
            6.二叉查找树
            7.平衡二叉树
            8.红黑树
         */

        /*  栈   后进先出 先进后出
            队列 先进先出 后进后出
            数组 随机访问 查询效率高
                根据地址和索引 连续存储空间
                删除效率低 需要前移数据 (添加同理)
            链表 顺序访问 与数组相反
                每一个数据称结点 不只存储自己 还存储上一个或下一个元素的地址值
                每一个结点都是独立对象 在内存中是不连续的 查询慢 增删块






         */
    }
}
