""" 杨辉三角就是一个用数排列起来的三角形，杨辉三角规则如下：
    1）每行第一个数和最后一个数都为1，其它每个数等于它左上方和右上方的两数之和；
    2)第n行有n个数。

    注意：“列”指的是如图所标注的斜列。

    小青对杨辉三角的特点和规律研究得很明白，现要考察你对杨辉三角的熟悉程度，首先
    告知你这是一个N行的杨辉三角，然后又告知了两个数值X和Y(X行，Y列)，让你根据杨
    辉三角的特点和观察到的规律解决以下两个问题。
    1）第X行第Y列对应的数是多少；
    2）求出N行的杨辉三角中第Y列中所有数的和。

    输入描述
    第一行输入一个正整数N(2<N<30)，表示杨辉三角的行数
    第二行输入两个正整数X和Y(<=N)，分别表示第X行和第Y列，正整数间以英文逗号隔开
    输出描述
    输出两个整数，分别表示N行的杨辉三角中第X行Y列对应的数，及第Y列上所有数的和，两个
    整数之间以一个英文逗号隔开
"""
N = int(input())
# X Y是列表a里的坐标 因此输入时写list map
X,Y = list(map(int,input().split(",")))

# 列表生成式 [1]*N会创建一个包含N个1的列表
a =[[1]*N for i in range(N)]



# 开始创建杨辉三角 第0行->1 第1行->1 1 第2行-> 1 2 1 从第二行开始更改数字
for x in range(2,N):
    for y in range(1, x): # 1->x 中间的是要更改的数字 即不包含0和最后一个位置x
        a[x][y] = a[x-1][y] + a[x-1][y-1]

# 打印列表 杨辉三角
for row in a:
    print(row)



# 该位置数字 从0开始数
res1 = a[X-1][Y-1]

# 计算竖直和 从最后一个元素 往前加 x-1为当前所在行 再减1为索引表示形式
res2 = 0
for t in range(X-1,Y-1-1,-1):
    res2 += a[t][Y-1]


print("%d,%d"%(res1,res2))













