""" 工人砌了一面奇特的砖墙，该墙由N列砖组成(1 <= N <= 106)，且每列砖的数量
    为Ki(1<=K<=104，相邻两列砖之间无缝隙)，每块砖的长宽高都为1。
    小蓝为了美化这面墙，需要在这面墙中找到一块面积最大的矩形用于涂鸦，
    那么请你帮助小蓝找出最大矩形，并输出其面积。
    例如：N=6，表示这面墙有6列，每列砖的数量依次为3、2、1、5、6、2，

            ■        这面墙如图 透明方块为所求的最大矩形 -> 10
          ▢▢
          ▢▢
    ■     ▢▢
    ■ ■   ▢▢ ■
    ■ ■ ■ ▢▢ ■

    不局限于横竖 只要求最大矩形

    输入描述
    第一行输入一个正整数N(1 <= N <= 106)，表示这面砖墙由几列砖组成
    第二行输入N个正整数Ki(1 <= Ki <= 104)，表示每列砖的数量，正整数之间以一个空格隔开
    输出描述
    输出一个正整数，表示最大矩形的面积
    样例输入
    6
    321562
    样例输出
    10
"""
n = int(input())
a = list(map(int,input().split()))

res = []
for i in range(n):
    # 向左考虑凹陷
    p1 = i - 1

    # 向右考虑凹陷
    p2 = i + 1

    s1 = s2 = 0 # 存储结果

    while p1 >= 0 and a[p1] >= a[i]:
        s1 += 1 # 向左考虑一列 发现可以算作矩形
        p1 -= 1

    while p2 < n and a[p2] >= a[i]:
        s2 += 1
        p2 += 1

    rect = (s1+s2+1) * a[i] # 最终结果=(左侧列个数+右侧列个数) * 第i列的高度
    res.append(rect)
print(res)
print(max(res))