""" 在一个神奇空间里有N个房间，房间从1到N编号，每个房间可能有一个或多个传送门，
    每个传送门都有一个编号，如果相同编号的传送门同时出现在多个房间中，表示这些
    房间可以互通。给定两个房间的编号A和B，请找出从房间A到达房间B最少需要经过几
    个传送门。

    例如：N=3，3个房间中传送门的编号分别为：
    房间1(房间编号)：1(传送门)、4、6；
    房间2：         2、3、    4，8；
    房间3：            3、      6、9

                    3号互通 4号互通 6号互通

    第一行输入一个正整数N(2<=N<=20)，表示房间数量,接下来输入N行，每行包含多个正整
    数(1<=正整数<=100)，第2行到第N+1行依次表示1到N号房间内所有传送门的编号，正
    整数之间以一个英文逗号隔开最后一行输入两个正整数A和B(1<=A<=N，1<=B<=N，且A!=B)，
    表示两个房间的编号，正整数之间以一个英文逗号隔开

    输出描述
    输出一个整数，表示从房间A到达房间B最少需要经过几个传送门，如果
    房间A不能到达房间B，则输出-1

    样例输入
    3         房间数量
    1,4,6     每个房间的传送门编号
    2,3,4,8
    3,6,9
    1,2       需要传送的起始房间和终止房间
    样例输出
    1

    首先判断是否有直通的传送门 如果没有考虑中介传送门

"""
n = int(input("房间数量"))

a = [] # 二维列表
for x in range(n):
    a.append(input("输入各个房间的传送门编号").split(","))

x,y = list(map(int,input().split(",")))

x,y = x-1,y-1 # 房间编号 索引


visited = [] # 记录已经经过的房间 即路线样貌
res = [] # 可以到达目标房间的路线数量 输出最小值即可

def find(room,cnt):
    if room == y:  # 到了
        res.append(cnt)
        return

    visited.append(room) # 路线经过的房间
    for i in range(len(a)):
        if i not in visited and set(a[room]) & set(a[i]):
            # 如果i房间没有被访问过 且与目标房间和起始房间的传送门有交集 就访问该房间
            find(i,cnt+1)
    visited.pop() # 集合.pop() 随机取出一个元素 意为寻找其他路线方法

find(x,0)
if len(res) == 0:
    print(-1)
else:
    print(min(res))












