""" 有N(1<=N<=100)根绳子 已知每根绳子初始长度(1<=长度<=1000) 每根绳子都可以
    再任意位置剪断 请计算小明最多可以剪成多少根长度为K(1<=K<=200)的绳子 如果
    不能剪成长度为K的绳子 输出0

    例如 N=4 4根绳子初始长度为2 3 4 10 K=3 最多可以剪成5根长度为3的绳子
    第一根不能剪 0
    第二根不用剪 3 +1
    第三根剪一次 3 +1
    第四根剪三次 +3 一共5根

    第一行输入一个正整数N表示原有绳子个数
    第二行输入N个正整数表示各个绳子长度
    第三行输入一个正数K 表示需要剪到的长度

    输出一个整数 表示指定长度的绳子最后有多少根 如果都没有输出0

    样例输入 2 3 4 10
    输出 5
"""
N = int(input())
a = list(map(int,input().split()))
K = int(input())

res = 0
for s in a: # 遍历所有绳子
    res += s//K # 如果s能被K整除 就说明可剪成要求长度
print(res)









