""" 请编写一段程序，给定n*m大小的棋盘，以及马的初始位置(x，y)，
    要求不能重复经过棋盘上的同一个点，计算马可以有多少途径滴历棋盘上的所有点。

    输入 第一行为整数T(T< 10)，表示测试数据组数。
        每一组测试数据包含一行，为四个整数，分别为棋盘的大小以及初始位置坐标
        n, m, x, y。(0 <= x <= n-1, 0 <= y <= m-1, m<10, n<10)
    输出 每组测试数据包含一行，为一个整数，表示马能遍历棋盘的途径总数，0为无法遍历一次。

    样例输入 1
            5 4 00
    样例输出 32

    递归 + 回溯

    马的走法: 马走日 一共走三步 横向+纵向
             要么x走两步y走一步 要么y走两步x走一步
    ▲: x+2 y+2, x+1 y+1, x-2 y+1, x-1 y+2,
       x-2 y-1, x-1 y-2, x+2 y-1, x+1 y-2
"""
t = int(input("输入一共有多少组"))  # 第一个输入数据 表示一共要测试几组

for _ in range(t):
    m,n = 5, 4 #  行 列
    a,b = map(int, input("输入初始坐标x y").split(" "))  # 初始坐标xy

    dirs = [(2,1),(1,2),(-2,1),(-1,2),(-1,-2),(-2,-1),(2,-1),(1,-2)]

    # 列表生成式 棋盘二维列表
    board = [[0]*n for x in range(m)]  # m行(0, m-1)  n列(0, n-1)

    # 0标记没有走过
    cnt = 0 # 计数器 表示路径数量 不重复

    def move(x,y,step):
        global cnt # 全局变量

        if step == m*n:
            cnt += 1 # 一共走了3步 相当于一种新的走法 计数器+1
            return

        for i in range(8):  # dirs中一共8个走法
            next_x = x + dirs[i][0]  # 行的便移
            next_y = y + dirs[i][1]  # 列的偏移

            if next_x >= 0 and next_x <= m-1 and next_y >= 0 and next_y <= n-1 and board[next_x][next_y] == 0:
                board[next_x][next_y] = 1  # 标记为1 当前位置再经过时不会考虑
                move(next_x, next_y, step+1)  # 下一个位置
                board[next_x][next_y] = 0  # 进入下一次循环后 将本次循环的标记变回0
                """ 此处为深度优先算法的回溯思想
                    标记为1防止重复访问 回溯为0来探索其他路径
                    
                    eg.
                   .
                    /A -> B 
                    -> C -> D   从A到D有两种走法 循环走其中一种时 A标记为1
                                需要回到A判断另一种走法 此时A标记为0
                """

# a,b = 0,0
board[a][b] = 1  # 马走过的地方标记1
move(a,b,1)
print(cnt)
