""" 十进制中 含6 8的数字称幸运数 将所有幸运数排序 第一个幸运数是6
    8 66 68 86 88 ...

    给定n 输出所有从大到小排列的幸运数

    看成二进制 6->0 8->1 用二进制的顺序映射幸运数的序列(不直接转二进制的原因)
    0 1 10 11 100
    6 8 68 96 88

    如何将十进制数字通过上述等式变成6和8
    eg. 输入n=7输出该幸运数字
    二进制每一级是2^n个 可以理解为
    第一排2^1 -> 0 1
    第二排2^2 -> 10(3) 11(4) 100(5) 101(6)
    第三排2^3 -> 110(7) 111 1000 1001 1010 1011 1100 1101

    7 = 2 + 4 + 1 7位于第三排 即2^3=8 而2+4+1=7<8

    如果直接把7转成二进制再转成幸运数字 不符合题目的序列逻辑 只能得到孤立的888结果
    无法满足"生成所有幸运数取前n个的要求"
"""
n = 7
s = 0 # 排数次幂 第一排2 第二排4 第三排8
i = 0 # 指数
while s<n: # 如果s小于n就往下再数一排 直到s>n为正常情况
    s = s + 2**(i+1) # 双乘号表幂级数 2的i+1次幂 i默认为0 因此i+1第一项为1
    i += 1 # 此时i变成了i+1 但排数仍然是2^i 即2**i

# 偏移量 差值 如果n=7 已知2^3=8 2+4+1=7 偏移量offset=1
offset = n - (s-2**i) - 1     # 减1 表示从0开始的偏移量 -6

# 十进制n转换为二进制数 格式
def decimal_biary(n):
    s = "" # 存储转换后的二进制字符串
    while n:
        res = n % 2 # 定义res为n除2的余数 n=7 % 2 = 1
        s = str(res) + s # 把res直接并到s的前面
        n = n // 2 # 再整除再取余
    return s
# print(decimal_biary(n)) # 得到了n的二进制
# 上述函数可以直接用内置函数代替 bin十进制转二进制 bin(n) 然后进行切片
"""
b = bin(n)
b = b[2:] 
"""


# 此处插入对bin的讲解
a = 9
b = bin(a) # b是a的二进制 结果为0b1001
b = b[2:] # 切片操作 [start:end] [2:]从2开始切取到字符串末尾 变成了1001


# 继续该算法
res = decimal_biary(offset)
res = '0'*(i-len(res)) + res # 给字符串长度补0
res = res.replace('0', '6').replace('1', '8')
print(res)



