# 1.给定正整数N 计算N除以7的商   //整除  %求余
from itertools import filterfalse

a = int(input("需要整除于7的数"))
res = a // 7
print(res)


a = [
    [1,2,3],
    [4,5,6],
    [7,88,9],
    [0,1,2]
]
# 已知矩阵 取第8个元素
n = 7 # 0 1 2 3 4 5 6 7 索引为7时是第8个元素
x = n // 3
y = n % 3
print(a[x][y])



# 2.给定正整数N 计算出从1到N之间所有奇数和
n = int(input("输出全部奇数"))
res = 0
for i in range(1, n+1):
    if i % 2 != 0:
        res += i
print(res)


for j in range(1, n+1, 2):
    res += j
print(res)



""" 3.有一组连续正整数，随机乱序后生成一组数据后，小蓝不小心删掉了其中一个数，
    已知所删掉的这个数 不是这组数据中最小的也不是最大的，现在请你编写程序帮助
    小蓝找到删除的那个数。
    
    输入描述：按照“编程实现”中的描述模仿输入一组这样的正整数数（正整数之间以英
    文逗号隔开），在输入的时候少一个数（这个数不是这组数据中最小的也不是最大的），
    这个数作为小蓝删除掉的那个数，且加上小蓝删除 的那个数这组数据是连续的

    输出描述：输出删除掉的是哪个数
    样例输入：3, 2, 4, 6, 7
    样例输出：5
"""
list = input("连续整数丢了一个数").split(",")
for i in range(len(list)):
    list[i] = int(list[i])

list.sort() # sort从小到大

a = list[0]
b = list[-1] # 最后一个元素

for num in range(a,b+1):
    if num not in list:
        print(num)
        break



# 4.水仙花数
# 输入N 判断100-N 有多少个正水仙花数
N = int(input("水仙花数"))
res = 0

def is_shui(N):
    a = N % 10
    b = N // 10 % 10
    c = N // 100
    if a*a*a+b*b*b+c*c*c == N:
        # a**3+b**3+c**3
        return True
    else:
        return False

for i in range(100, N+1):
    if is_shui(i):
        res += 1
print(res)



""" 5.有一个密室逃脱游戏，有100间密室连在一排。密室编号是从1开始连续
      排列一直排到第100间密室，如下图：
    
      游戏规则：
        1.玩家初始位置在1号密室；
        2.每次玩家可以进入右边的一个密室，也可以跳过一个密室进入下个密室
        （如：当玩家当前在3号密室，他可以进入4号密室也可以进入5号密室）；
        3.有毒气的的密室不能进入
        
      编程实现：
        给定三个正整数X，Y，M(X<Y<Ms100)，表示三个密室编号。X号密
        室和Y号密室有毒气泄漏，不能进入，玩家需要进入到M号密室。按照游
        戏规则进入M号密室有多少种路线方案。例如：X=2，Y=4，M=7，进入
        M号密室有2种路线方案，分别是1->3->5->6->7路线和1->3->5->7路线。
        
      输入描述：输入三个正整数XY，M(X<Y<M)，X和Y表示有毒气密室
            编号，M表示需要进入的密室编号，且三个正整数之间以英文逗号隔开
    
      输出描述：输出进入M号密室有多少种路线方案
      样例输入：2, 4, 7
      样例输出：2
        
        1 -> 2
             3 -> 4
                  5 -> 6 -> 7
                       7
"""
# x,y,m = input().split()
# x,y,m = int(x),int(y),int(m)
x = 2
y = 4
m = 7 # 目标密室
def find(m): # 确认目前是否到达目标密室
    # 必须先判断毒气的房间 否则会在递归过程中把有毒气的路径加进去
    if m == x or m == y: # 如果要到达的密室是毒气密室 那么不能去
        return 0
    if m == 1 or m == 2: # 如果要到达的密室是密室1或者密室2 那只有一种走法不需要后期判断
        return 1

    # 如果不是上述情况
    res = find(m-1) + find(m-2) # 递归
    # 如果判断到该行 说明到达m密室可以达成 我们判断从m-1和m-2是否可行
    # 设有一个不能执行 另一个可行 判断可行的那个密室的上一步
    # 如果两个都可行 判断两个的上一步 就是4个密室再次判断 这样累加下来可以得到最终可以走的密室的个数
    return res

res = find(m)
print(res)



""" 6.(N皇后)编程实现：有一个N*N的矩阵方格和N个棋子，现在需要将N个棋子按要求
               放置到矩阵方格中。要求如下：
        任意两个棋子不能在同一行、同一列、同一对角线上（下图红色线段都为对角线）
        根据以上要求，问N个棋子放置到N*N矩阵方格中有多少种放置方案
        例如：4*4的矩阵方格，4个棋子，有2种放置方案
        
        N皇后问题主要判断逻辑: 主对角线差等 副对角线和等 水平没有 竖直没有
"""
N = 4 # 需要放置的皇后个数
list = [[0 for i in range(N)] for j in range(N)] # 创建二维棋盘

def check(x,y): # 我现在拿着(x,y)坐标对整个棋盘做检查
    for i in range(N): # 假设我固定y 检查该横向所有的i中有没有皇后 有就与(x,y)的皇后重复
        if list[i][y] == 1: # 检查列
            return False
    for i in range(N):
        for j in range(N): # 遍历整个棋盘检查主对角线
            if x-y == i-j and list[i][j] == 1: # n皇后问题主对角线逻辑 差相等 就说明斜线上有重复
                return False
    for i in range(N):
        for j in range(N): # n皇后问题副对角线逻辑 和相等就说明反斜线上有重复
            if x+y == i+j and list[i][j] == 1:
                return False
    return True

ans = 0 # 统计放置方法
def dfs(num): # 对整个棋盘深度优先搜索算法 num既是皇后个数也是行数 要求第i行及之前已经放好了i个皇后
    global ans

    if num == N: # 所有皇后全部放置了
        ans += 1 # 这代表我执行了一次完整的把所有皇后放下的方案 ans+1 然后重新考虑所有皇后位置
        return
    else:
        for i in range(N): # i变化 遍历棋盘每一列
            if check(num, i): # 如果条件满足了 说明没有皇后
                list[num][i] = 1 # 放置一个皇后
                dfs(num+1)
                list[num][i] = 0 # 回溯 意义是试错后恢复初始状态 为其他所有潜在可能方案准备后悔药

dfs(0)
print(ans)



# 7.循环语句for i in range(8, -4, -2) 一共执行6次

# 8.turtle.circle(80, steps=6) 绘制一个半径为80像素的元内接正六边形

# 切片操作 最后一个元素是-1索引


""" 9.已知a=2021.0529 想输出2021.05
    -> print("{:.2f}".format(a))
    format函数必须有冒号:
"""


""" 10.已知pi=3.1315924 运行print(round(pi),round(pi,2))
    -> 3 3.13                    输出整数位 保留两位小数
"""


""" 11.d={"beijing":"china", "washington":"america","ottawa":"canadian"}
    print(max(d), min(d))
    
    字典 比较大小比较的是键值(键值对) 比较ASCII码 也就是字母顺序 a最小 z最大
    
    输出结果为 washington beijing
"""


""" 12.p=ord("b") 运行print(p,chr((p+3)%26+p)) 输出结果为

    ord()返回ASCII码中16进制 a=97 A=65
    chr()已知ASCII码 求原字符字母 98+3=101 

    101%26=23 101对26取余求余数 26*3=78 101-78=23 

    23+98=121 y
    98 y
"""


# 13.输入n个数 整数和小数 求最大数
list = input("输入n个数 用,切割").split(",")

n = len(list)
# 将字符变成数值
for i in range(n):
    list[i] = float(list[i])
print(list)

res = max(list)
print(res)



# 14.给定一个合数n 将n分解为质因数后 输出其质因数个数
n = int(input())
count = 0
i = 2
while n > 1:
    while n % i == 0:
        count += 1
        n = n // i
        # print(i)
    i += 1
print(count)



""" 15.给定一个大于2的偶数，在所有满足“任意一个大于2的偶数可以由两
    个质数相加得到”这个特点的质数对中，找出两个质数差值最小的一对，
    并将差值输出（差值为大数减小数的值，两个质数相等时差值为0）。
    
    例如：偶数16，满足特点的质数对有(5，11)和(3，13)，差值最小的一
    对是(5，11)，11减5，差值为6。

    输入描述：输入一个大于2的偶数N
    输出描述：输出满足“任意一个大于2的偶数可以由两个质数
    相加得到”这个特点的所有质数对中，差值最小的那一对的差值
    
    样例输入：16
    样例输出：6
"""
num = int(input())

# 判断质数
def isPrime(n):
    for i in range(2,n//2+1):
        # 范围 从2开始 到n的一半
        if n % i == 0:
            return False
    return True

mid = num // 2
for a in range(mid,1,-1): # 从mid开始遍历 到第一个数据
    b = num - a
    if isPrime(a) and isPrime(b):
        print(b-a)
        break



""" 16.输入描述：输入n对正整数，每一对正整数之间以一个空格隔开，代表放置红色花
    卉的方格位置。每对正整数中的两个数字以英文逗号隔开
    输出描述:输出最多有多少盆红色花卉在同一条直线上

    样例输入：2,1  3,2  5,2  4,3  3,4  6,5  (红花)
    样例输出：4 (最多四个共线)
    
    1,6 2,6 3,6 4,6 5,6 6,6 ... 100,6
    1,5 2,5 3,5 4,5 5,5 6,5                                         6,5
    1,4 2,4 3,4 4,4 5,4 6,4             ->          3,4
    1,3 2,3 3,3 4,3 5,3 6,3                               4,3
    1,2 2,2 3,2 4,2 5,2 6,2                         3,2         5,2
    1,1 2,1 3,1 4,1 5,1 6,1                    2,1
    
    如果水平看 一共最多有两个同一条直线
    竖直看    2个
    主对角线  3个
    副对角线  4个
    
    对角线判断方法: 主对角线x+y相同 副对角线x-y相同 (x,y)->(1,6)
"""

# 输入
list = input().split()
c = []
for i in list:
    a,b=i.split(",")
    a,b = int(a), int(b) # 将list转换成元组放到c里
    c.append((a,b))

hang = {}    # 行字典
lie = {}     # 列字典
zhuDui = {}  # 主对角线 x+y
fuDui = {}   # 副对角线 x-y

for item in c:
    x,y = item[0],item[1]
    # item是一个二维坐标 无论item取c中的哪个坐标 x代表item[0] y代表item[1]
    # item[0][1]=(x,y)

    if x in hang: # 判断横向直线
        hang[x] += 1
    else:
        hang[x] = 1

    if y in lie: # 判断纵向直线
        lie[y] += 1
    else:
        lie[y] = 1

    if x+y in zhuDui: # 判断主对角线
        zhuDui[x+y] += 1
    else:
        zhuDui[x+y] = 1

    if x-y in fuDui: # 判断副对角线
        fuDui[x-y] += 1
    else:
        fuDui[x-y] = 1

print(hang,lie,zhuDui,fuDui)

a = max(hang.values())
b = max(lie.values())
c = max(zhuDui.values())
d = max(fuDui.values())

res = max(a,b,c,d)
print(res)



""" 17. 给定一个含有字母和数字的字符串，输出字符串中最长的数字子串的长度。
    如：字符串‘a2a22d’，最长的数字子串为22，长度为2，故输出2
    字符串‘lql2h567j765'，最长数字子串为567和765（长度都为3）故输出3
    
    输入描述：输入一个含有字母和数字的字符串(5<字符串长度<101)
    输出描述：输出此字符串中最长的数字子串的长度
    样例输入：a2a22d
    样例输出：2
"""
s = input()
b = ''  # 存储字符串结果
n = len(s)
for i in range(n):
    if '0' <= s[i] <= '9':
        b += s[i] # 拼接字符串
    else:
        b += ' '

b = b.split()
c = [] # 存储数字长度结果
for i in b:
    c.append(len(b))
print(max(c))



# 18. readtext() 不是文件读操作


# 19.random.uniform(a,b) 随机生成一个a到b间的浮点数


# 20.字典中表示字典值的是: for i in range d.value:
# {key:value}


# 21.goto()函数 跑到某个指定坐标点


# 22.pensize()函数 设置画笔大小


# 23.setup()函数 定义窗体大小


# 24.hideturtle()函数 将海龟隐藏



# 25.统计1-N所有正整数中个位数为0的有几个
N = int(input())
count = 0
for i in range(1, N+1):
    if i % 10 == 0:
        count += 1
print(count)



# 26.输入多个英文单词(小写) 按照字典顺出排序输出
# 首字母(相同就比较第二个) python,hello,world
words = input().split(',')
words.sort()
res = ",".join(words) # join字符串方法 连接
print(res)



""" 27.编程实现：小蓝和小青在玩积木搭建游戏，具体玩法如下：
    小蓝报一个数字N，代表高楼的高度，小青则需要使用最少的积木搭建出高度大于N的高楼，
    给出小蓝所报出的数字N，及已有积木块每一块的高度，请你帮助小青找出最少需要多少块
    积木可以搭建出高度大于N的高楼，
    
    例如：N=12，已有4个积木块的高度分别为4.7.84
    则最少需要2块积木，可以使搭建的高楼高度大于12，2块积木为7和8。
    
    输入描述：
    第一行输入一个正整数N，表示小蓝报出的数字
    第二行输入多个正整数，表示已有积木块每一块的高度，正整数之间以一个英文逗号隔开。（要求所有正整数之和大于N）
    
    输出描述：
    输出最少需要使用多少块积木，可以搭建出高度大于N的高楼
"""
n = int(input("输入一个高度"))
blocks = list(map(int,input().split(','))) # 输入积木 列表 通过map映射操作把积木变成int类型
blocks.sort(reverse = True) # 降序排序

i = 0
res = 0
while n >= 0:
    n = n - blocks[i]
    i += 1
    res += 1
print(res) # 输出积木个数 计数器



# 约瑟夫环 与28题逻辑相似 循环报数
""" 28.编程实现：N个小朋友围成一圈(N<=60)，并按照顺序进行编号(编号1到N)，然后从编号为1
    的小朋友开始持续报数，当报到的数字中含3或者数字是3的倍数的小朋友，不能报数字而是报“过”（
    例如，6，13，31这些数字都报“过”）。
    
    一次游戏中，小朋友们玩的不亦乐乎，突然有小朋友发现前边报过的数字中已经有报错的，而后边小
    朋友还在继续报数。请你帮助小朋友找出第一次报错的小朋友是编号几。
    
    例如：有3个小朋友，编号为1，2，3。编号1的小朋友报1、编号2的小朋友报2、编号3的小朋友报“过”、
    编号1的小朋友报4、编号2的小朋友报5、编号3的小朋友报6、编号1的小朋友报7；此时第一次报错的小
    朋友为编号3。（因为编号3的小朋友应该报“过”时，报成了“6”，而“6"是3的倍数）
    
    输入描述：
    第一行输入一个正整数N，表示小朋友的人数
    第二行输入一组有错的报数序列(“0"表示含3或者是3的倍数的数字)，序列元素之间以一个英文逗号隔开
    
    输出描述：
    输出第一次报错的小朋友是编号几
"""
n = int(input("输入n个小朋友"))
a = eval(input("输入报的数(字符串)"))
a = list(a)

c = 0
value = 0

for i in a:
    c += 1
    value += 1 # 报序号 1 2 3 4 5 6 不考虑"过"

    if c > n:
        c = 1 # 进行第二轮循环

    if (value % 3 == 0 or '3' in str(value)) and i != 0:
        # 如果value是3的倍数了 那么i应该是0 如果i != 0 那么就是报数错误了
        print(c) # 是应该"过"的数字
        break

    if i != value:
        print(c)
        break



""" 29.编程实现：有N个正整数，现对N个正整数进行不同方式的排列，每次排列后都会按照以下规则
    进行一次计算，聪明的小蓝发现，排列方式不同，最后计算出的结果也不相同。
    
    计算规则：
    第一次：第一个数乘以第二个数乘以第三个数，结果记录为M(1);
    第二次：第二个数乘以第三个数乘以第四个数，结果记录为M(2)；
    第三次：第三个数乘以第四个数乘以第五个数，结果记录为M(3)；
    第N-2次：第N-2个数乘以第N-1个数乘以第N个数，结果记录为M(N-2)。
    最后计算M(1)+M(2)+M(3).....M(N-2)的数值。
    找出一种排列方式使这个数值最大。
    
    例如：N=4，4个正整数分别为1，2，3，4，那么排列方式就会有24种：
    其中排列方式为1，3，4，2时，按照规则计算2次：1*3*4=12，3*4*2=24；乘积相加：12+24=36
    这种排序方式是所有乘积相加的数值最大，为36。
    
    输入描述：
    输入N个正整数(35N)，正整数之间一个英文逗号隔开
    输出描述：
    找出所有乘积相加的数值愚大的排列方式，并输出数值
"""

# 假设数字有1 2 3 4 数字的全排列表示
a = [1,2,3,4] # a = list(map(int,input().split(',')))
n = len(a)
a.insert(0,0) # 在列表0位置中插入元素0 a = [0,1,2,3,4]

f = [0] * (n+1) # 标记 旗帜   创建一个长度为n+1 (长度为5) 的列表f 所有的元素为0 f = [0,0,0,0,0]
b = [0] * (n+1) # 用于存储结果 创建一个长度为n+1 (长度为5) 的列表b 同样都为0

maxp = 0

def nums(i):
    global maxp

    if i == n+1:
        tmp = 0
        for j in range(n-1):
            tmp += b[j]*b[j+1]*b[j+2]
        if maxp < tmp:
            maxp = tmp
        return # 循环终止条件

    for x in range(1, n+1): # 遍历每一个索引
        if f[x] == 0: # 代表该位置未被使用过
            f[x] = 1 # 标记使用
            b[i] = a[x] # 将这个索引放在b里
            nums(i+1) # 递归
            f[x] = 0

nums(1)
print(maxp)



""" 30.编程实现：有一块农田被划分为N*M块，农作物和杂草分布生长在农田中，其中农作物使用
    大写字母“R"表示，杂草使用大写字母“X”表示，请计算出农田中有几块独立的农作物区域（独
    立的农作物区域指该区域上下左右都被杂草围住，且N"M以外的区域都是杂草）。

    例如：N=4，M=4，4*4的农田中农作物和杂草分布如下图：
    R R R X
    R X R X
    X X X R
    R X X X
    这块4*4的农田中有3块独立的农作物区域（红色的3部分）
    
    输入描述：
    第一行输入两个整数N和M(1SNS100，1SMS100)，N表示农田的行数，M表示农田的列数，且两个正整数之间以一个英文逗号隔开
    接下来的N行每行包括M个字符（字符只能为R或X），R表示农作物，X表示杂草，字符之间以一个英文逗号隔开
    
    输出描述：
    输出一个整数，表示N*M的农田中有几块独立的农作物区域
"""
m,n = input().split()
m,n = int(m), int(n)
a = []
for x in range(m):
    tmp = input().split()
    a.append(tmp)


def dfs(x,y):
    # 超出范围 或 该区域是杂草
    if x < 0 or x >= n or y < 0 or y >= m or a[x][y] == 'X':
        return

    # 该区域是农作物 标记该区域 表示已经判断过了
    a[x][y] = 'X'
    dfs(x-1,y)
    dfs(x+1,y)
    dfs(x,y+1)
    dfs(x,y-1)


count = 0
for i in range(m):
    for j in range(n):
        if a[i][j] == "R":
            dfs(i,j)
            count += 1

print(count)



""" 31.复数可以看作二元有序浮点数    √
       实部和虚部都是浮点数         √
       虚数部分的后缀j J不区分大小写 √
       可以用a.real获取虚数部分     ×
       
        a.real 获取实部部分 a.imag获取虚部部分
        a = 2+3j 复数
"""



""" 32. a={16,18,7}
        print(type(sorted(a))) 输出结果为
        
        <class 'list'>
"""
